{
  "experience": [
    {
      "company": "Hublo",
      "title": "Site Reliability Engineer",
      "dates": {
        "start": "Apr 2024",
        "end": "Sep 2024",
        "duration": "6 months"
      },
      "location": {
        "country": "France",
        "city": "Paris",
        "type": "Remote"
      },
      "responsibilities": [
        "Worked alongside two SREs within a 30-member engineering team.",
        "Set up and scaled Kubernetes clusters on AWS using Pulumi for staging and production environments, followed by the migration of the ECS cluster to Kubernetes namespaces.",
        "Deployed an SFTP server, a CRM, several web applications, and data applications using Pulumi and Helm, and improved build times for legacy applications.",
        "Streamlined and secured networking in our AWS accounts by implementing appropriate security groups, peerings, and TLS. This also reduced costs and made the infrastructure easier to manage.",
        "Automated the deployment of Snowflake and Metabase using Terraform, created Helm charts, and established a CI/CD pipeline for the data engineering team.",
        "Deployed CDNs for the frontend applications.",
        "Configure a Network Load Balancer to handle both layer 4 and layer 7 traffic for services.",
        "Also contributed to open-source efforts, including the sftpgo/helm-chart."
      ]
    },
    {
      "company": "Cloud Crafted Engineers",
      "title": "Freelance Engineer",
      "dates": {
        "start": "Jul 2023",
        "end": "Nov 2023",
        "duration": "5 months"
      },
      "location": {
        "country": "France",
        "city": "Paris",
        "type": "Hybrid"
      },
      "responsibilities": [
        "As a freelance engineer, I worked with two clients on separate short-term projects:",
        "For 6Wind, a Cisco competitor (8 weeks), contributed to a testing framework in Python and C to assess the load and functionality of a router OS. Executed tests on-premise using Ansible and KVM for durations of up to 8 hours.",
        "For Lengow, a B2B marketplace feed management company (4 weeks), I co-designed a scalable AWS cloud infrastructure to support feature deployment, set up CI/CD services, and automated software release processes.",
        "Additionally, I contributed to open-source projects like OpenTofu during this period."
      ]
    },
    {
      "company": "Contentsquare",
      "title": "Platform Engineer",
      "dates": {
        "start": "Apr 2022",
        "end": "Jun 2023",
        "duration": "1 year 3 months"
      },
      "location": {
        "country": "France",
        "city": "Rennes",
        "type": "On-site"
      },
      "responsibilities": [
        "As the most junior member of a 20+ platform engineering team in a 300+ person R&D department, I helped deploy and maintain key infrastructure technologies, including Kubernetes, Ansible, Terraform, Spinnaker, and GitHub Actions.",
        "Migrated numerous Jenkins pipelines to GitHub Action workflows.",
        "Led the refactoring of the Clickhouse Ansible deployment from Python 2.7 to Python 3.8 and built Ansible collections.",
        "Created a Terraform provider for Pritunl VPN.",
        "Worked on a proof of concept to implement Spinnaker, facilitating git-based workflows for creating and updating Managed Delivery configurations.",
        "Developed a Python wrapper for Netflix Dispatch to enable quick deployment and scaling within our infrastructure as part of a proof of concept, serving as a replacement for PagerDuty.",
        "Took an active role in managing multi-cloud deployments across Azure and AWS, optimizing cloud resources to ensure high availability.",
        "Worked alongside developers to support feature rollouts, troubleshoot issues, and keep services running smoothly.",
        "I also helped enhance the deployment process for the monitoring stack.",
        "Contributed to several open-source projects, including Dispatch Netflix, Kibana Elasticsearch, Pritunl, Tfam, and Tfexe."
      ]
    },
    {
      "company": "Groupe SII",
      "title": "DevOps Engineer",
      "dates": {
        "start": "Jun 2021",
        "end": "Jan 2022",
        "duration": "8 months"
      },
      "location": {
        "country": "France",
        "city": "Rennes",
        "type": "On-site"
      },
      "responsibilities": [
        "As the only DevOps engineer supporting a team of 12 developers, I managed four GKE clusters (about 5 nodes each), handling ~300 simultaneous users and maintaining their CI/CD pipelines for Brittany Ferries.",
        "Led the migration of four terraformed GKE clusters to new infrastructure, incorporating FluxCD, ConfigConnector, Istio, Google KMS, and Sops."
      ]
    },
    {
      "company": "CIL Lamballe",
      "title": "DevOps Engineer",
      "dates": {
        "start": "Nov 2020",
        "end": "May 2021",
        "duration": "7 months"
      },
      "location": {
        "country": "France",
        "city": "Lamballe",
        "type": "On-site"
      },
      "responsibilities": [
        "Deployed a Kubernetes cluster on bare metal servers with HAProxy, Heartbeat and MetalLB using Ansible.",
        "Migrated applications like OpenStreetMap and enhanced reliability in a self-hosted environment.",
        "Upgraded VMware vSphere on all servers to enable Kubernetes Datastore support via VMware CNS API and CSI driver integration.",
        "Automated OSRM map builds, containerizing and deploying them on Kubernetes for scalability.",
        "Conducted penetration testing and developed internal tools to simulate network threat scenarios.",
        "Wrote systemd unit files and cross-compiled Rust-based daemons to monitor NAS activity.",
        "Managed certificates for various Linux/Windows services.",
        "Managed a database migration from MySQL to PostgreSQL, handling a 2-year version gap.",
        "Upgraded and configured Centreon for system monitoring and alerting.",
        "Deployed GLPI and Sentinel on Kubernetes for asset management and security monitoring.",
        "Contributed to open-source initiatives, including Mattermost."
      ]
    },
    {
      "company": "CIL Lamballe",
      "title": "DevOps Intern",
      "dates": {
        "start": "Jul 2020",
        "end": "Oct 2020",
        "duration": "4 months"
      },
      "location": {
        "country": "France",
        "city": "Lamballe",
        "type": "On-site"
      },
      "responsibilities": [
        "As part of a team of 2 system administrators and 11 developers, I gathered requirements from the infrastructure team and developed a daemon in Rust to prevent ransomware and protect network-attached storage from user errors.",
        "Additionally, I deployed 3CX VoIP and maintained all Linux virtual machines and their associated services.",
        "Contributed to open-source projects, including Rust-lang, during this period."
      ]
    },
    {
      "company": "Wavestone",
      "title": "Financial Services Consultant",
      "dates": {
        "start": "Jan 2018",
        "end": "Aug 2018",
        "duration": "8 months"
      },
      "location": {
        "country": "France",
        "city": "Paris",
        "type": "Hybrid"
      },
      "responsibilities": [
        "Led the user acceptance testing (UAT) of La Banque Postale's mobile application and facilitated daily stand-ups as well as weekly meetings/retrospectives.",
        "Managed a request for proposal (RFP) to completely overhaul Vallourec's IT infrastructure, involving approximately 5,000 units."
      ]
    },
    {
      "company": "Crédit Agricole CIB",
      "title": "Structured Finance Analyst",
      "dates": {
        "start": "Jun 2017",
        "end": "Dec 2017",
        "duration": "7 months"
      },
      "location": {
        "country": "France",
        "city": "Paris",
        "type": "On-site"
      },
      "responsibilities": [
        "Developed financial models for structured finance in the Oil & Gas Upstream sector, working closely with reservoir engineers.",
        "Prepared business memorandums and executive notes, and communicated with middle office for syndication.",
        "Analyzed the Brent curve and its volatility, and coded this analysis into financial models to simulate cash flow scenarios and improve risk assessment."
      ]
    },
    {
      "company": "BrickVest",
      "title": "Executive Assistant to Chief Executive Officer",
      "dates": {
        "start": "Jan 2016",
        "end": "Dec 2016",
        "duration": "1 year"
      },
      "location": {
        "country": "United Kingdom",
        "city": "London",
        "type": "On-site"
      },
      "responsibilities": [
        "Joined BrickVest, an early-stage FinTech company, where I onboarded venture capital firms and new investors.",
        "Took responsibility for accounting, tax declarations with HMRC, and ensured regulatory compliance."
      ]
    }
  ]
}
